<i>Создаем общую таблицу </i>

In [1]:
import pandas as pd
dateparser1 = lambda x: pd.datetime.strptime(x, '%Y-%m-%d %H:%M:%S')
dateparser2 = lambda x: pd.datetime.strptime(x, '%d.%m.%y %H:%M:%S')
df1=pd.read_csv('file1', delimiter='|',parse_dates=['t'],date_parser=dateparser1)
df2=pd.read_csv('file2', delimiter='\t',decimal=',', parse_dates=['time'],date_parser=dateparser2)
df1.columns=['time', 'af_3483','zr_4352']
dfmerged=pd.merge(df1, df2, on = 'time',how='outer')
dfmerged.sort_values('time', inplace=True)

<i>Записываем в csv </i>

In [2]:
dfmerged.to_csv('file_merged', sep='\t', index=False)

<i>Аггрегируем помесячно </i>

In [3]:
dfmerged.groupby(pd.Grouper(key='time', freq='M')).mean()

              af_3483    zr_4352    tr_3485    tr_3486    tr_3487    tr_3488
time
2016-01-31  10.499001  98.478207  11.499683  12.499967  13.500262  14.498428
2016-02-29  30.456432  98.518101  11.500787  12.500110  13.499296  14.498278
2016-03-31  10.501813  98.531305  11.498864  12.500351  13.499708  14.497650

In [4]:
dfmerged.groupby(pd.Grouper(key='time', freq='M')).count()

            af_3483  zr_4352  tr_3485  tr_3486  tr_3487  tr_3488
time
2016-01-31  2678400  2678400  1722758  1722758  1722758  1722758
2016-02-29  2505600  2505600  2498173  2498173  2498173  2498173
2016-03-31   826000   826000  1761069  1761069  1761069  1761069